package study;

public class Inheritance {

	public static void main(String[] args) {
		/*
		상속 : 이미 만들어져있는 클래스 상속해서 새로운 클래스를 정의 할때 사용 
		: 클래스를 구성하는 규칙, 가이드
		클래스 상속 -> 변수와 메서드를 상속 받는다.
		
		생성자는 따로 상속 받지 않는다.
		
		문법 : class 새로운 클래스 이름 extends 이전 클래스(부모 클래스)
		
		상속은 재활용 + 알파 (클래스를 만드는 가이드)
		
		오버라이딩 Overriding
		상속받은 메서드의 내용을 상속받는 클래스에 맞게 변경하는 것
		조건 :
		 - 선언부가 같아야한다. (이름. 매개변수, 리턴타입)
		 - 접근제어자를 좁은 범위로 변경 할 수 없다.메서드가  protected라면, 범위가 같거나 넓은 protected나 public으로만 변경 할 수 있다.
		 - 조상 클래스의 매서드보다 많은 수의 예외를 선언 할 수 없다.
		 
		 오버로딩 : 기존에 없는 새로운 메서드를 정의하는 것(매개변수가 틀림)
		 오버라이딩  : 상속받은 메서드의 내용을 변경
		 
		 
		
		
		*/
		

	}

}
