package study;

public class AbstractInterface {
	
	/* 
	 추상클래스와 인터페이스
	 추상 클래스 - 미완성
	 인터페이스 클래스(추상화 정도가 더 높음)
	 
	 인스턴스로 만들지 못한다.
	 상속을 목적으로 함
	 클래스 가이드, 규칙을 만드는 목적으로 함
	 
	 인스턴스X 클래스를 만드는 규칙이나 가이드를 정의하기위함
	 
	 -추상메서드를 하나이상 포함하고 있는 클래스
	 -정의하지만 처리부분이 없는 것 {}가 없음
	 -abstract void play(int pos);
	 -추상메서드를 오버라이딩한다 - > 메서드를 구현한다.
	 
	 
	 인터페이스(interface)
	 -추상화 정도가 높다
	 -실제 구현된 것이 전혀 없는 기본 설계
	 -새로운 클래스를 만들때 이용
	 -미리 정해진 규칙에 맞게 구현하도록 표준을 제시하는데 사용된다
	 -추상메서드와 상수만을 멤버로 가질 수 있다
	 -상속 = 구현 (멤버(추상메서드와 상수)를 가져옴)
	 */

}
